app/controllers/api/posts_controller.rb

    def index
      @posts = Post.where(author_id: params[:user_id])
      if @posts.empty?
---
SELECT "posts".* FROM "posts" WHERE "posts"."author_id" = $1  [["author_id", 1]]
SELECT 1 AS one FROM "posts" WHERE "posts"."author_id" = $1 LIMIT $2  [["author_id", 1], ["LIMIT", 1]]