app/controllers/comments_controller.rb

SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "comments" ("author_id", "post_id", "text", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["author_id", 1], ["post_id", 1], ["text", "aaaaa"], ["created_at", "2022-11-18 14:16:27.653319"], ["updated_at", "2022-11-18 14:16:27.653319"]]
---
  def create
    @post = Post.find(params[:post_id])
    @comment = @post.comments.new(comment_params)
    @comment.author_id = current_user.id
    if @comment.save

DELETE FROM "comments" WHERE "comments"."id" = $1  [["id", 8]]
SELECT "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
---
  def destroy
    Comment.find(params[:id]).destroy