app/controllers/likes_controller.rb

  def create
    @post = Post.find(params[:post_id])
    @like = @post.likes.new
    @like.author_id = current_user.id
    @like.post_id = @post.id
    if @like.save
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 20], ["LIMIT", 1]]
INSERT INTO "likes" ("author_id", "post_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["author_id", 1], ["post_id", 20], ["created_at", "2022-11-10 19:23:26.738422"], ["updated_at", "2022-11-10 19:23:26.738422"]]